from dotenv import load_dotenv
import os, socket

load_dotenv()

JSON_FILE_NAME = os.getenv('JSON_FILE_NAME')
print(f"json_file_name : {JSON_FILE_NAME}")

TOKEN = os.getenv("TOKEN")
print(f"token : {TOKEN}")

host_name = socket.gethostbyaddr(socket.gethostname())[0]
print(f"host_name : {host_name}")

PREFIX = os.getenv("PREFIX")
print(f"prefix : {PREFIX}")

ADMIN_ID = os.getenv("ADMIN_ID")
print(f"admin_id : {ADMIN_ID}")

KOR_TOKEN = os.getenv("KOR_TOKEN")
print(f"kor_token : {KOR_TOKEN}")

area_list = ['서울시','부산시','대구시','인천시','광주시','대전시','울산시','세종시','경기도','강원도','충청북도','충청남도','전라북도','전라남도','경상북도','경상남도','제주도','제주특별자치도']
back_area_list = ['서울', '서울시', '서울교육청', '서울시교육청', '서울특별시','부산', '부산광역시', '부산시', '부산교육청', '부산광역시교육청','대구', '대구광역시', '대구시', '대구교육청', '대구광역시교육청','인천', '인천광역시', '인천시', '인천교육청', '인천광역시교육청','광주', '광주광역시', '광주시', '광주교육청', '광주광역시교육청','대전', '대전광역시', '대전시', '대전교육청', '대전광역시교육청','울산', '울산광역시', '울산시', '울산교육청', '울산광역시교육청','세종', '세종특별시', '세종시', '세종교육청', '세종특별자치시', '세종특별자치시교육청','경기', '경기도', '경기교육청', '경기도교육청','강원', '강원도', '강원교육청', '강원도교육청','충북', '충청북도', '충북교육청', '충청북도교육청','충남', '충청남도', '충남교육청', '충청남도교육청','전북', '전라북도', '전북교육청', '전라북도교육청','전남', '전라남도', '전남교육청', '전라남도교육청','경북', '경상북도', '경북교육청', '경상북도교육청','경남', '경상남도', '경남교육청', '경상남도교육청','제주', '제주도', '제주특별자치시', '제주교육청', '제주도교육청', '제주특별자치시교육청', '제주특별자치도']
back_school_type_list = ['유치원', '유','유치','초등학교', '초','초등','중학교', '중','중등','고등학교', '고','고등','특수학교', '특','특수','특별']
school_type_list = ['유치원', '초등학교','중학교', '고등학교','특수학교']

school_type_high = ['고등학교', '고','고등']
school_type_middle = ['중학교', '중','중등']
school_type_elementary = ['초등학교', '초','초등']
school_type_special = ['특수학교', '특','특수','특별']

Souel = ['서울', '서울시', '서울교육청', '서울시교육청', '서울특별시']
Busan = ['부산', '부산광역시', '부산시', '부산교육청', '부산광역시교육청']
Deagu = ['대구', '대구광역시', '대구시', '대구교육청', '대구광역시교육청']
Incheon = ['인천', '인천광역시', '인천시', '인천교육청', '인천광역시교육청']
Gwangju = ['광주', '광주광역시', '광주시', '광주교육청', '광주광역시교육청']
Daejeon = ['대전', '대전광역시', '대전시', '대전교육청', '대전광역시교육청']
Ulsan = ['울산', '울산광역시', '울산시', '울산교육청', '울산광역시교육청']
Sejong = ['세종', '세종특별시', '세종시', '세종교육청', '세종특별자치시', '세종특별자치시교육청']
Gyeonggi = ['경기', '경기도', '경기교육청', '경기도교육청']
Gangwon = ['강원', '강원도', '강원교육청', '강원도교육청']
Chungcheongbuk = ['충북', '충청북도', '충북교육청', '충청북도교육청']
Chungcheongnam = ['충남', '충청남도', '충남교육청', '충청남도교육청']
Jeollabuk = ['전북', '전라북도', '전북교육청', '전라북도교육청']
Jeollanam = ['전남', '전라남도', '전남교육청', '전라남도교육청']
Gyeongsangbuk = ['경북', '경상북도', '경북교육청', '경상북도교육청']
Gyeongsangnam = ['경남', '경상남도', '경남교육청', '경상남도교육청']
Jeju = ['제주', '제주도', '제주특별자치시', '제주교육청', '제주도교육청', '제주특별자치시교육청', '제주특별자치도']

last_notice = []
last_personal_notice = ""